
** RDF syntax

#+BEGIN_SRC sh :results output :exports both
for file in */*.ttl; do
  echo $file
  rapper -i turtle -c $file 2>&1 ; 
  echo "---------------------"
done
#+END_SRC

#+RESULTS:
#+begin_example
example/example-block.ttl
rapper: Parsing URI file:///home/martige/repo/equinor/symbol-vocabulary/example/example-block.ttl with parser turtle
rapper: Parsing returned 18 triples
---------------------
example/example-symbol.ttl
rapper: Parsing URI file:///home/martige/repo/equinor/symbol-vocabulary/example/example-symbol.ttl with parser turtle
rapper: Parsing returned 27 triples
---------------------
example/example-type.shacl.ttl
rapper: Parsing URI file:///home/martige/repo/equinor/symbol-vocabulary/example/example-type.shacl.ttl with parser turtle
rapper: Parsing returned 49 triples
---------------------
schema/symbol.owl+shacl.ttl
rapper: Parsing URI file:///home/martige/repo/equinor/symbol-vocabulary/schema/symbol.owl+shacl.ttl with parser turtle
rapper: Parsing returned 263 triples
---------------------
#+end_example


*** example/example-type.shacl.ttl

#+CALL: sh_jena_shacl_validate(shapes="http://shipshape.dyreriket.xyz/std-vocabulary-elements.ttl http://www.w3.org/ns/shacl-shacl#", data="example/example-type.shacl.ttl")

#+RESULTS:
#+BEGIN_src ttl
Validating RDF data <example/example-type.shacl.ttl> against SHACL shape <http://shipshape.dyreriket.xyz/std-vocabulary-elements.ttl>:
@prefix rdf:  <http://www.w3.org/1999/02/22-rdf-syntax-ns#> .
@prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#> .
@prefix sh:   <http://www.w3.org/ns/shacl#> .
@prefix xsd:  <http://www.w3.org/2001/XMLSchema#> .

[ rdf:type     sh:ValidationReport ;
  sh:conforms  true
] .

Validating RDF data <example/example-type.shacl.ttl> against SHACL shape <http://www.w3.org/ns/shacl-shacl#>:
@prefix rdf:  <http://www.w3.org/1999/02/22-rdf-syntax-ns#> .
@prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#> .
@prefix sh:   <http://www.w3.org/ns/shacl#> .
@prefix xsd:  <http://www.w3.org/2001/XMLSchema#> .

[ rdf:type     sh:ValidationReport ;
  sh:conforms  true
] .

#+END_src

#+RESULTS:
#+begin_example
Validating RDF data <example/example-type.shacl.ttl> against SHACL shape <http://shipshape.dyreriket.xyz/std-vocabulary-elements.ttl>:
@prefix rdf:  <http://www.w3.org/1999/02/22-rdf-syntax-ns#> .
@prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#> .
@prefix sh:   <http://www.w3.org/ns/shacl#> .
@prefix xsd:  <http://www.w3.org/2001/XMLSchema#> .

[ rdf:type     sh:ValidationReport ;
  sh:conforms  true
] .

Validating RDF data <example/example-type.shacl.ttl> against SHACL shape <http://www.w3.org/ns/shacl-shacl#>:
@prefix rdf:  <http://www.w3.org/1999/02/22-rdf-syntax-ns#> .
@prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#> .
@prefix sh:   <http://www.w3.org/ns/shacl#> .
@prefix xsd:  <http://www.w3.org/2001/XMLSchema#> .

[ rdf:type     sh:ValidationReport ;
  sh:conforms  true
] .
#+end_example

